caching/data/middleware.ab.txt
This is ApacheBench, Version 2.3 <$Revision: 655654 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        PasteWSGIServer/0.5
Server Hostname:        localhost
Server Port:            8000

Document Path:          /middleware
Document Length:        37 bytes

Concurrency Level:      1
Time taken for tests:   19.619 seconds
Complete requests:      10000
Failed requests:        0
Write errors:           0
Total transferred:      3470000 bytes
HTML transferred:       370000 bytes
Requests per second:    509.70 [#/sec] (mean)
Time per request:       1.962 [ms] (mean)
Time per request:       1.962 [ms] (mean, across all concurrent requests)
Transfer rate:          172.72 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.1      0       1
Processing:     2    2   0.3      2      15
Waiting:        0    1   0.5      1      12
Total:          2    2   0.2      2      16

Percentage of the requests served within a certain time (ms)
  50%      2
  66%      2
  75%      2
  80%      2
  90%      2
  95%      2
  98%      3
  99%      3
 100%     16 (longest request)